object1= input("Введите назнвание первого предмета- ")
object2= input("Введите назнвание второго предмета- ")

number1= int(input("Введите колличество занятий по " + object1+ " за неделю -"))
number2= int(input("Введите колличество занятий по " + object2+ " за неделю -"))

time1= int(input("Введите продолжительность занятия по " + object1+ " в минутах - "))
time2= int(input("Введите продолжительность занятия по " + object2+ " в минутах - "))

freeTime= float(input("Введите доступное время в неделю в часах - "))

load1= number1*time1
load2= number2*time2

print(f"{object1} занимает у вас {load1:.2f} минут в неделю")
print(f"{object2} занимает у вас {load2:.2f} минут в неделю")

print(f"Общая нагрузка равна {load2+load1} минут или {(load2+load1)/60:.2f} часов")

print(f"После этого у вас остается {(freeTime - (load2+load1)/60):.2f} часов свободного времени")

print(f"Общая нагрузка за 4 недели равна {(load2+load1)/60*4:.2f} часов")